soap-file-service/getbase64Req.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://docs.oasis-open.org/ns/cmis/messaging/200908/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:getDocumentRequest>
         <ns:objectId>idd_e58a5389-d5d4-40a1-a14c-1a3c0ee60465</ns:objectId>
      </ns:getDocumentRequest>
   </soapenv:Body>
</soapenv:Envelope>